#### Terraform Plan 📖 `success`

<details><summary>詳細なログを表示</summary>

```terraform
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
infra/environments/dev relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/web-daw-backend/web-daw-backend/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/web-daw-backend/web-daw-backend

To view this run in a browser, visit:
https://app.terraform.io/app/isb-ikenoya-study/web-daw-backend/runs/run-7njoJQtcyx1hcETd

Waiting for the plan to start...

Terraform v1.14.6
on linux_amd64
Initializing plugins and modules...
module.codegenie-api.data.archive_file.layer_zip: Refreshing...
module.route53.data.aws_route53_zone.parent: Refreshing...
module.cloud_front.data.aws_route53_zone.this: Refreshing...
module.cloud_front.aws_cloudfront_origin_access_control.s3: Refreshing state... [id=E3INN5EP3F96LR]
module.route53.aws_route53_zone.public_zone: Refreshing state... [id=Z07777823QWN63F6XYQ35]
module.codegenie-api.aws_apigatewayv2_api.this: Refreshing state... [id=8usf1u2f1g]
module.codegenie-api.aws_iam_role.lambda_exec: Refreshing state... [id=web-daw-dev-lambda-role]
module.codegenie-api.aws_s3_bucket.lambda: Refreshing state... [id=web-daw-dev-api-bucket]
module.s3_front_end.aws_s3_bucket.front: Refreshing state... [id=web-daw-dev-front-bucket]
module.codegenie-api.aws_iam_role_policy_attachment.lambda_logs: Refreshing state... [id=web-daw-dev-lambda-role/arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole]
module.cloud_front.data.aws_route53_zone.this: Refresh complete after 1s [id=Z07777823QWN63F6XYQ35]
module.route53.data.aws_route53_zone.parent: Refresh complete after 1s [id=Z05552098SOY2YNHN5H]
module.route53.aws_route53_record.parent_ns_delegation: Refreshing state... [id=Z05552098SOY2YNHN5H_various-ikenoya.isb-bs.com_NS]
module.acm.aws_acm_certificate.virginia_cert: Refreshing state... [id=arn:aws:acm:us-east-1:374474405705:certificate/8809591b-ccd9-493e-99f6-7a0c6d0bfe52]
module.acm.aws_route53_record.route53_acm_dns_resolve["various-ikenoya.isb-bs.com"]: Refreshing state... [id=Z07777823QWN63F6XYQ35__42d33b35779d7766862cd281f522ffc4.various-ikenoya.isb-bs.com_CNAME]
module.acm.aws_acm_certificate_validation.cert_valid: Refreshing state... [id=2026-03-04 08:17:13.091 +0000 UTC]
module.codegenie-api.aws_apigatewayv2_stage.lambda_stage: Refreshing state... [id=main-stage]
module.codegenie-api.data.archive_file.layer_zip: Refresh complete after 3s [id=c6295dca63fadc21cbde10cf459e1c417437d582]
module.codegenie-api.aws_lambda_layer_version.demo_layer: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:374474405705:layer:layer-demo-ikenoya:12]
module.codegenie-api.aws_s3_object.dummy: Refreshing state... [id=web-daw-dev-api-bucket/initial/lambda_fix_v4.zip]
module.s3_front_end.aws_s3_bucket_public_access_block.front: Refreshing state... [id=web-daw-dev-front-bucket]
module.cloud_front.aws_cloudfront_distribution.this: Refreshing state... [id=E5443JXSUPKLD]
module.cloud_front.aws_route53_record.record_aaaa: Refreshing state... [id=Z07777823QWN63F6XYQ35_various-ikenoya.isb-bs.com_AAAA]
module.cloud_front.aws_route53_record.record_a: Refreshing state... [id=Z07777823QWN63F6XYQ35_various-ikenoya.isb-bs.com_A]
module.cloud_front.data.aws_iam_policy_document.front: Refreshing...
module.cloud_front.data.aws_iam_policy_document.front: Refresh complete after 0s [id=4167549089]
module.cloud_front.aws_s3_bucket_policy.front: Refreshing state... [id=web-daw-dev-front-bucket]
module.codegenie-api.aws_lambda_function.api: Refreshing state... [id=web-daw-dev-api]
module.codegenie-api.aws_apigatewayv2_integration.lambda_integration: Refreshing state... [id=vct83m4]
module.codegenie-api.aws_lambda_permission.api_gw: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.codegenie-api.aws_apigatewayv2_route.api_route: Refreshing state... [id=qirrnga]
module.codegenie-api.aws_lambda_layer_version.demo_layer: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.codegenie-api.aws_lambda_function.api will be updated in-place
  ~ resource "aws_lambda_function" "api" {
        id                             = "web-daw-dev-api"
      ~ layers                         = [
          - "arn:aws:lambda:ap-northeast-1:374474405705:layer:layer-demo-ikenoya:12",
        ] -> (known after apply)
        tags                           = {
            "created_by" = "yuta_ikenoya"
        }
        # (32 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.codegenie-api.aws_lambda_layer_version.demo_layer must be replaced
-/+ resource "aws_lambda_layer_version" "demo_layer" {
      ~ arn                         = "arn:aws:lambda:ap-northeast-1:374474405705:layer:layer-demo-ikenoya:12" -> (known after apply)
      ~ code_sha256                 = "vCU1J7qjPJsEhxPYm53ygf6FtJI2kFns7bpLhH+kd4E=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2026-03-12T08:06:09.998+0000" -> (known after apply)
      - filename                    = "../../modules/lambda-node-api/layer.zip" -> null # forces replacement
      ~ id                          = "arn:aws:lambda:ap-northeast-1:374474405705:layer:layer-demo-ikenoya:12" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-northeast-1:374474405705:layer:layer-demo-ikenoya" -> (known after apply)
      + s3_bucket                   = "web-daw-dev-api-layer-bucket" # forces replacement
      + s3_key                      = "layers/nodejs-api.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_size            = 14306211 -> (known after apply)
      ~ version                     = "12" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.codegenie-api.aws_s3_bucket.layer_upload[0] will be created
  + resource "aws_s3_bucket" "layer_upload" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "web-daw-dev-api-layer-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-northeast-1"
      + request_payer               = (known after apply)
      + tags                        = {
          + "created_by" = "yuta_ikenoya"
        }
      + tags_all                    = {
          + "created_by" = "yuta_ikenoya"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.codegenie-api.aws_s3_object.layer_upload[0] will be created
  + resource "aws_s3_object" "layer_upload" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "web-daw-dev-api-layer-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "layers/nodejs-api.zip"
      + kms_key_id             = (known after apply)
      + region                 = "ap-northeast-1"
      + server_side_encryption = (known after apply)
      + source                 = "../../modules/lambda-node-api/layer.zip"
      + source_hash            = "vCU1J7qjPJsEhxPYm53ygf6FtJI2kFns7bpLhH+kd4E="
      + storage_class          = (known after apply)
      + tags                   = {
          + "created_by" = "yuta_ikenoya"
        }
      + tags_all               = {
          + "created_by" = "yuta_ikenoya"
        }
      + version_id             = (known after apply)
    }

Plan: 3 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @isb-ikenoya, Action: `pull_request`*